var r = +prompt('Введите радиус:', '0.00');
if (isNaN(r) || r < 0) {
    r = +prompt('Вы ввели неправильное значение, повторите попытку:', '0.00');
}
var h = +prompt('Введите высоту:', '0.00');
if (isNaN(h) || h < 0) {
    r = +prompt('Вы ввели неправильное значение, повторите попытку:', '0.00');
}
var s = Math.PI * Math.sqrt(r);
var v = s * h;

document.writeln(
    '<h1>**************</h1>',
    '<h1>' + 'Обьем цилиндра с площадью основы ' + Math.round(s * 1000) / 1000 + ', радиусом ' + r + ' и высотой ' + h + ' равен: ' + Math.round(v * 1000) / 1000 + '</h1>',
    '<h1>--------------------</h1>',
    '<h1>' + 'V = ' + Math.round(v * 1000) / 1000 + '</h1>',
    '<h1>--------------------</h1>',
    '<h1>' + 'end.' + '</h1>'
);